src/cf/DocumentJournals/УчетРабочегоВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DocumentJournal>
		<Properties>
			<Name>УчетРабочегоВремени</Name>
			<RegisteredDocuments>
				<xr:Item>Document.ЕжедневныйОтчет</xr:Item>
				<xr:Item>Document.ЕженедельныйОтчет</xr:Item>
			</RegisteredDocuments>
		</Properties>
		<ChildObjects>
			<Column>
				<Properties>
					<Name>ДлительностьРабот</Name>
					<References>
						<xr:Item>Document.ЕжедневныйОтчет.Attribute.ДлительностьРабот</xr:Item>
						<xr:Item>Document.ЕженедельныйОтчет.Attribute.ДлительностьРабот</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ДлительностьРабочая</Name>
					<References>
						<xr:Item>Document.ЕжедневныйОтчет.Attribute.ДлительностьРабочая</xr:Item>
						<xr:Item>Document.ЕженедельныйОтчет.Attribute.ДлительностьРабочая</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>НекорректнаяДлительность</Name>
					<References>
						<xr:Item>Document.ЕжедневныйОтчет.Attribute.НекорректнаяДлительность</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Сотрудник</Name>
					<References>
						<xr:Item>Document.ЕженедельныйОтчет.Attribute.Сотрудник</xr:Item>
						<xr:Item>Document.ЕжедневныйОтчет.Attribute.Сотрудник</xr:Item>
					</References>
				</Properties>
			</Column>
		</ChildObjects>
	</DocumentJournal>
</MetaDataObject>

src/cf/InformationRegisters/ИсполнителиРолейИДелегаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИсполнителиРолейИДелегаты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ИсполнительДелегат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РольСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ПолныеРоли</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НастройкаДелегирования</Name>
					<Comment>Настройку делегирования, по которой была сделана запись в регистре.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗамещающиеИПомощники</v8:Type>
						<v8:Type>cfg:CatalogRef.УдалитьДелегированиеПрав</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяОбластиДелегирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/DocumentJournals/УчетРабочегоВремени/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
	
// Возвращает список с подразделениями, в которых переданный пользователь является руководителем
// с учетом делегирования прав по ежедневным отчетам или всех прав
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи
// 
// Возвращаемое значение:
//  Массив - Массив подразделений, где пользователь руководит непосредственно
//	или через делегирование. Отсортирован по представлениям подразделений.
//
Функция МассивПодразделенийДляПросмотраОтчетовОТрудозатратах(Сотрудник) Экспорт

	ЗапросПользователей = Новый Запрос;
	ЗапросПользователей.Текст = 
		"ВЫБРАТЬ
		|	ИсполнителиРолейИДелегаты.РольСотрудник КАК РольСотрудник
		|ИЗ
		|	РегистрСведений.ИсполнителиРолейИДелегаты КАК ИсполнителиРолейИДелегаты
		|ГДЕ
		|	ИсполнителиРолейИДелегаты.ИсполнительДелегат = &ИсполнительДелегат
		|	И ИсполнителиРолейИДелегаты.ИмяОбластиДелегирования В (""ЕжедневныеОтчеты"", """")";
	
	ЗапросПользователей.УстановитьПараметр("ИсполнительДелегат", Сотрудник);
	МассивПользователей = ЗапросПользователей.Выполнить().Выгрузить().ВыгрузитьКолонку("РольСотрудник");
	МассивПользователей.Добавить(Сотрудник);
	
	Подразделения = СтруктураПредприятия.ПодчиненныеПодразделения(МассивПользователей, Истина);
	
	СписокПодразделений = Новый СписокЗначений;
	СписокПодразделений.ЗагрузитьЗначения(Подразделения);
	СписокПодразделений.СортироватьПоЗначению();
	
	Возврат СписокПодразделений.ВыгрузитьЗначения();
	
КонецФункции

#КонецОбласти

#КонецЕсли
